In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
import warnings
warnings.filterwarnings('ignore')

In [2]:
df_seoul = pd.read_csv('test/0320_test/ta_seoul.csv', encoding='cp949')
df_daegu = pd.read_csv('test/0320_test/ta_daegu.csv', encoding='cp949')

In [3]:
df_seoul = pd.DataFrame(df_seoul)
df_seoul.columns = ['날짜', '지점', '서울평균', '서울최저', '서울최고']
df_daegu = pd.DataFrame(df_daegu)
df_daegu.columns = ['날짜', '지점', '대구평균', '대구최저', '대구최고']
display(df_seoul)
display(df_daegu)

               날짜   지점  서울평균  서울최저  서울최고
0      1907-10-01  108  13.5   7.9  20.7
1      1907-10-02  108  16.2   7.9  22.0
2      1907-10-03  108  16.2  13.1  21.3
3      1907-10-04  108  16.5  11.2  22.0
4      1907-10-05  108  17.6  10.9  25.4
...           ...  ...   ...   ...   ...
41374  2022-03-16  108  10.3   3.6  16.8
41375  2022-03-17  108  10.7   7.8  15.1
41376  2022-03-18  108   7.5   5.5   9.6
41377  2022-03-19  108   3.4   0.9   6.1
41378  2022-03-20  108   5.4   2.2   9.3

[41379 rows x 5 columns]

               날짜   지점  대구평균  대구최저  대구최고
0      1907-01-31  143   NaN  -7.0   0.8
1      1907-02-01  143   NaN   NaN   NaN
2      1907-02-02  143   NaN   NaN   NaN
3      1907-02-03  143   NaN   NaN   NaN
4      1907-02-04  143   NaN   NaN   NaN
...           ...  ...   ...   ...   ...
42048  2022-03-16  143  14.4   5.1  23.0
42049  2022-03-17  143   8.8   6.3  13.6
42050  2022-03-18  143   6.1   4.3   8.1
42051  2022-03-19  143   4.9   3.0   8.1
42052  2022-03-20  143   6.6   2.0  11.0

[42053 rows x 5 columns]

In [249]:
# interpolate(method='values')로서 선형으로 비례하여 결측값을 채워준다.
df_seoul.interpolate(method='values', inplace=True)
df_daegu.interpolate(method='values', inplace=True)
display(df_seoul)
display(df_daegu)

               날짜   지점  서울평균  서울최저  서울최고
0      1907-10-01  108  13.5   7.9  20.7
1      1907-10-02  108  16.2   7.9  22.0
2      1907-10-03  108  16.2  13.1  21.3
3      1907-10-04  108  16.5  11.2  22.0
4      1907-10-05  108  17.6  10.9  25.4
...           ...  ...   ...   ...   ...
41374  2022-03-16  108  10.3   3.6  16.8
41375  2022-03-17  108  10.7   7.8  15.1
41376  2022-03-18  108   7.5   5.5   9.6
41377  2022-03-19  108   3.4   0.9   6.1
41378  2022-03-20  108   5.4   2.2   9.3

[41379 rows x 5 columns]

               날짜   지점  대구평균  대구최저  대구최고
0      1907-01-31  143   NaN  -7.0   0.8
1      1907-02-01  143   NaN  -6.6   1.2
2      1907-02-02  143   NaN  -6.2   1.6
3      1907-02-03  143   NaN  -5.8   2.0
4      1907-02-04  143   NaN  -5.4   2.4
...           ...  ...   ...   ...   ...
42048  2022-03-16  143  14.4   5.1  23.0
42049  2022-03-17  143   8.8   6.3  13.6
42050  2022-03-18  143   6.1   4.3   8.1
42051  2022-03-19  143   4.9   3.0   8.1
42052  2022-03-20  143   6.6   2.0  11.0

[42053 rows x 5 columns]

In [4]:
df_seoul.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41379 entries, 0 to 41378
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   날짜      41379 non-null  object
 1   지점      41379 non-null  int64
 2   서울평균    40623 non-null  float64
 3   서울최저    40621 non-null  float64
 4   서울최고    40620 non-null  float64
dtypes: float64(3), int64(1), object(1)
memory usage: 1.6+ MB

In [250]:
filt = df_daegu[['대구최저', '대구최고']].sum(axis=1)
filt

0        -6.2
1        -5.4
2        -4.6
3        -3.8
4        -3.0
         ...
42048    28.1
42049    19.9
42050    12.4
42051    11.1
42052    13.0
Length: 42053, dtype: float64

In [251]:
df_daegu['대구평균'].fillna(filt, inplace=True)
df_daegu

               날짜   지점  대구평균  대구최저  대구최고
0      1907-01-31  143  -6.2  -7.0   0.8
1      1907-02-01  143  -5.4  -6.6   1.2
2      1907-02-02  143  -4.6  -6.2   1.6
3      1907-02-03  143  -3.8  -5.8   2.0
4      1907-02-04  143  -3.0  -5.4   2.4
...           ...  ...   ...   ...   ...
42048  2022-03-16  143  14.4   5.1  23.0
42049  2022-03-17  143   8.8   6.3  13.6
42050  2022-03-18  143   6.1   4.3   8.1
42051  2022-03-19  143   4.9   3.0   8.1
42052  2022-03-20  143   6.6   2.0  11.0

[42053 rows x 5 columns]

In [252]:
df_daegu.isnull().sum()

날짜      0
지점      0
대구평균    0
대구최저    0
대구최고    0
dtype: int64

### 1. 기상 관측 이래, 서울의 최고 기온이 가장 높았던 날은 언제였고, 몇도인가요?

In [253]:
df_seoul.sort_values('서울최고', ascending=False)

               날짜   지점  서울평균  서울최저  서울최고
40051  2018-08-01  108  33.6  27.8  39.6
31277  1994-07-24  108  33.1  28.1  38.4
40050  2018-07-31  108  32.6  27.8  38.3
13111  1943-08-24  108  29.0  23.2  38.2
11636  1939-08-10  108  30.1  24.5  38.2
...           ...  ...   ...   ...   ...
18293  1959-01-05  108 -16.4 -19.8 -13.1
28155  1986-01-05  108 -16.4 -19.2 -13.6
2662   1915-01-14  108 -18.0 -21.3 -13.8
8503   1931-01-11  108 -17.4 -22.5 -14.7
2661   1915-01-13  108 -19.2 -21.3 -16.3

[41379 rows x 5 columns]

In [254]:
filt = df_seoul['서울최고'] == df_seoul['서울최고'].max()
df_seoul['서울최고'].max()

39.6

In [255]:
df_seoul[['날짜', '서울최고']][filt]

               날짜  서울최고
40051  2018-08-01  39.6

### 2. 역사적으로 일교차가 가장 큰 날짜는 몇년 몇월 몇일 인가요?

In [256]:
df_seoul['일교차'] = df_seoul['서울최고'] - df_seoul['서울최저']

In [257]:
df_seoul.sort_values('일교차', ascending=False)

               날짜   지점  서울평균  서울최저  서울최고   일교차
12619  1942-04-19  108  12.7   2.5  24.3  21.8
3863   1918-04-29  108  16.7   4.6  26.3  21.7
3147   1916-05-13  108  18.1   8.3  29.7  21.4
13980  1946-01-09  108  -8.1 -13.6   7.7  21.3
6026   1924-03-31  108   9.0  -1.0  20.2  21.2
...           ...  ...   ...   ...   ...   ...
38205  2013-07-12  108  23.6  23.2  24.3   1.1
23225  1972-07-07  108  24.6  24.1  25.2   1.1
29556  1989-11-06  108  12.3  11.8  12.8   1.0
32724  1998-07-10  108  24.0  23.6  24.6   1.0
21968  1969-01-27  108  -0.1  -0.4   0.6   1.0

[41379 rows x 6 columns]

In [258]:
filt = df_seoul['일교차'] == df_seoul['일교차'].max()
df_seoul['일교차'].max()

21.8

In [259]:
df_seoul[['날짜', '일교차']][filt]

               날짜   일교차
12619  1942-04-19  21.8

### 3. 1년 중 평균적으로 일교차가 가장 큰 날짜는 몇월 몇일 인가요?

### 4. 가장 덥다고 알려진 대구보다 서울이 더 더운날이 가장 많은 연도는 언제인가요?

In [270]:
df_seoul['날짜'] = pd.to_datetime(df_seoul['날짜'],format='%Y-%m-%d')

In [272]:
df_seoul['year'] = df_seoul['날짜'].dt.year
df_seoul

              날짜   지점  서울평균  서울최저  서울최고   일교차  year
0     1907-10-01  108  13.5   7.9  20.7  12.8  1907
1     1907-10-02  108  16.2   7.9  22.0  14.1  1907
2     1907-10-03  108  16.2  13.1  21.3   8.2  1907
3     1907-10-04  108  16.5  11.2  22.0  10.8  1907
4     1907-10-05  108  17.6  10.9  25.4  14.5  1907
...          ...  ...   ...   ...   ...   ...   ...
41374 2022-03-16  108  10.3   3.6  16.8  13.2  2022
41375 2022-03-17  108  10.7   7.8  15.1   7.3  2022
41376 2022-03-18  108   7.5   5.5   9.6   4.1  2022
41377 2022-03-19  108   3.4   0.9   6.1   5.2  2022
41378 2022-03-20  108   5.4   2.2   9.3   7.1  2022

[41379 rows x 7 columns]

In [295]:
filt = df_seoul[['year', '서울최고']].value_counts().sort_values(ascending=False)
filt

year  서울최고
1995  25.1    9
1934  25.9    9
1983  26.9    8
2008  28.4    7
1977  16.2    7
             ..
1998  6.5     1
2007  1.7     1
1990  8.8     1
2011  16.9    1
2022  19.5    1
Length: 26135, dtype: int64

In [299]:
df

,날짜,지점_x,서울평균,서울최저,서울최고,일교차,지점_y,대구평균,대구최저,대구최고
0,1907-10-01,108,13.5,7.9,20.7,12.8,143,39.714815,12.011111,27.703704
1,1907-10-02,108,16.2,7.9,22.0,14.1,143,39.433333,11.800000,27.633333
2,1907-10-03,108,16.2,13.1,21.3,8.2,143,39.151852,11.588889,27.562963
3,1907-10-04,108,16.5,11.2,22.0,10.8,143,38.870370,11.377778,27.492593
4,1907-10-05,108,17.6,10.9,25.4,14.5,143,38.588889,11.166667,27.422222
...,...,...,...,...,...,...,...,...,...,...
41374,2022-03-16,108,10.3,3.6,16.8,13.2,143,14.400000,5.100000,23.000000
41375,2022-03-17,108,10.7,7.8,15.1,7.3,143,8.800000,6.300000,13.600000
41376,2022-03-18,108,7.5,5.5,9.6,4.1,143,6.100000,4.300000,8.100000
41377,2022-03-19,108,3.4,0.9,6.1,5.2,143,4.900000,3.000000,8.100000
41378,2022-03-20,108,5.4,2.2,9.3,7.1,143,6.600000,2.000000,11.000000